Catalogs/ГруппыХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГруппыХарактеристик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспаковатьРостовок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьНоль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОсновная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПошиваНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПошиваКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КомплектующиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КомплектующиеНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектующая</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаКомплектующей</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатурныеГруппы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПоКлассификатору</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыХарактеристик/Ext/ManagerModule.bsl
Процедура СоздатьНК(Владелец,Характеристики, Ссылка) Экспорт
	
	НайденаНК = НайтиСуществующуюНк(Владелец);
	//Если НЕ ЗначениеЗаполнено(НайденНК) Тогда
	//	Если Вопрос("Создать НК для группы?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	СоздатьЕдиницу = Ложь;	
	
	Если ЗначениеЗаполнено(НайденаНК) Тогда
		
		Ном = НайденаНК.ПолучитьОбъект();
		
	Иначе
		
		Ном = Справочники.Номенклатура.СоздатьЭлемент();
		Ном.ВестиУчетПоХарактеристикам = Истина;
		Ном.Нк = Владелец.Код;
		
		СоздатьЕдиницу = Истина;
		
	КонецЕсли;
	Ном.Родитель = Владелец.Родитель;
	Ном.Наименование = Владелец.Наименование + " (Рост-ка)";
	Ном.НаименованиеПолноеРус = Владелец.Наименование + " (Рост-ка)";
    Ном.НаименованиеПолное = Владелец.НаименованиеПолное + " (Рост-ка)";
		
	Ном.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000009");
	Ном.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
	Ном.ГруппаХарактеристик = Ссылка;
	Ном.Нк = Владелец.Код;
	
	Ном.Организация = Владелец.Организация;
	
	Ном.Записать();
	
	Если СоздатьЕдиницу Тогда
		
		НоваяЕдиница = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		
		НоваяЕдиница.Владелец                = Ном.Ссылка;
		НоваяЕдиница.ЕдиницаПоКлассификатору = Ном.БазоваяЕдиницаИзмерения;
		НоваяЕдиница.Наименование            = СокрЛП(НоваяЕдиница.ЕдиницаПоКлассификатору);
		НоваяЕдиница.Коэффициент             = 1;
		
		НоваяЕдиница.Записать();
		
		Ном.ЕдиницаХраненияОстатков = НоваяЕдиница.Ссылка;
		Ном.ЕдиницаДляОтчетов       = НоваяЕдиница.Ссылка;
		
		Ном.Записать();
		
	КонецЕсли;
	
	//характеристика
	НайденаХарактеристика = НКХарактетистика(Ссылка);
	Если ЗначениеЗаполнено(НайденаХарактеристика) Тогда
		Хар = НайденаХарактеристика.ПолучитьОбъект();
	Иначе
		Хар = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	КонецЕсли;
	Хар.КодНК = Ссылка.Код;
	Хар.Наименование = Ссылка.Наименование;
	
	Хар.Владелец = Ном.Ссылка;
	Хар.Записать();
	
	//комплектующие
	НЗ = РегистрыСведений.КомплектующиеНоменклатуры.СоздатьНаборЗаписей();
	НЗ.Отбор.Номенклатура.Установить(Ном.Ссылка);
	НЗ.Отбор.ХарактеристикаНоменклатуры.Установить(Хар.Ссылка);
	НЗ.Записать(Истина); // очистим
	
	Для Каждого Стр Из Характеристики Цикл
		НЗ = РегистрыСведений.КомплектующиеНоменклатуры.СоздатьМенеджерЗаписи();
		НЗ.Номенклатура = Ном.Ссылка;
		НЗ.Комплектующая = Владелец;
		НЗ.Количество= ?(Стр.Количество = 0,1,Стр.Количество);
		НЗ.ЕдиницаИзмерения = Владелец.ЕдиницаДляОтчетов;
		НЗ.ХарактеристикаКомплектующей = Стр.Характеристика;
		НЗ.ХарактеристикаНоменклатуры = Хар.Ссылка;
		НЗ.Записать(Истина);             ////////////////////////////////
	КонецЦикла;

КонецПроцедуры

Функция НайтиСуществующуюНк(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	 |	Номенклатура.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.Номенклатура КАК Номенклатура
	 |ГДЕ
	 |	Номенклатура.Нк = &Нк";
	
	
	Запрос.УстановитьПараметр("Нк", Номенклатура.Код);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		
		Запрос = Новый Запрос;
	
		Запрос.Текст = "ВЫБРАТЬ
		               |	Номенклатура.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Номенклатура КАК Номенклатура
		               |ГДЕ
		               |	Номенклатура.ГруппаХарактеристик.Владелец.Код = &Код";
		
		Запрос.УстановитьПараметр("Код", Номенклатура.Код);
		Рез = Запрос.Выполнить().Выбрать();

		Если Рез.Следующий() Тогда
			Возврат Рез.Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;

КонецФункции


Функция НКХарактетистика(ГруппаХар) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПолучимХарактеристикуНк.Ссылка КАК ХарактеристикаНк
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ПолучимХарактеристикуНк
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыХарактеристик КАК ГруппыХарактеристик
	               |		ПО (ГруппыХарактеристик.Наименование = ПолучимХарактеристикуНк.Наименование)
	               |			И (ГруппыХарактеристик.Владелец.Код = ПолучимХарактеристикуНк.Владелец.Нк
	               |				ИЛИ ПолучимХарактеристикуНк.Владелец.ГруппаХарактеристик.Владелец = ГруппыХарактеристик.Владелец)
	               |ГДЕ
	               |	ГруппыХарактеристик.Ссылка = &Ссылка";  	
	
	
	Запрос.УстановитьПараметр("Ссылка",ГруппаХар.ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.ХарактеристикаНк;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
